/* 企业发放的奖金根据利润提成。利润(I)低于或等于 10 万元时，奖金可提成 10%；利润高于 10 万元，低于 20 万元，
低于 10 万元的部分按 10% 提成，高于 10 万元的部分，可提成 7.5%。20 万到 40 万之间时，高于 20 万元的部分，可
提成 5%；40 万到 60 万之间时高于 40 万元的部分，可提成 3%；60 万到 100 万之间时，高于 60 万元的部分，可提成
1.5%，高于 100 万元时，超过 100 万元的部分按 1% 提成。从键盘输入当月利润 I，求应发放奖金总数？ */

package main

import "fmt"

func main() {

	var I float32 = 0.0
	var a float32 = 0.0

	fmt.Print("输入利润：")
	fmt.Scanf("%f\n", &I)

	switch {
	case I > 100*10000:
		a = (I - 100*10000) * 0.001
		I = 100 * 10000
		fallthrough
	case I > 60*10000:
		a += (I - 60*10000) * 0.015
		I = 60 * 10000
		fallthrough
	case I > 40*10000:
		a += (I - 40*10000) * 0.035
		I = 40 * 10000
		fallthrough
	case I > 20*10000:
		a += (I - 20*10000) * 0.05
		I = 20 * 10000
		fallthrough
	case I > 10*10000:
		a += (I - 10*10000) * 0.075
		I = 10 * 10000
		fallthrough
	default:
		a += I * 0.1
	}
	fmt.Println("提成总计：", a, "元")
}
